# Core tools
brew "fish"
brew "neovim"
brew "tmux"
brew "mosh"
brew "envchain"
brew "safe-rm"
brew "xclip"
brew "gcc"
brew "python"
brew "pipx"
brew "node"
brew "pnpm"

# Fonts
cask "font-fira-code-nerd-font"

# Formatters (conform.nvim)
brew "stylua"
brew "ruff"

# macOS-only
if OS.mac?
  brew "coreutils"
  brew "pyvim"
  brew "wget"
  brew "libusb"
  brew "pkg-config"
  brew "aerospace"
  brew "go"
  brew "tailscale"
  brew "git-credential-manager"
  cask "orbstack"
end
