# Core tools
brew "fish"
brew "neovim"
brew "tmux"
brew "mosh"
brew "envchain"
brew "safe-rm"
brew "xclip"
brew "gcc"
brew "python"
brew "pipx"
brew "node"
brew "pnpm"

# Formatters (conform.nvim)
brew "stylua"
brew "ruff"

# macOS-only
brew "coreutils" if OS.mac?
brew "pyvim" if OS.mac?
brew "wget" if OS.mac?
brew "libusb" if OS.mac?
brew "pkg-config" if OS.mac?
brew "aerospace" if OS.mac?
brew "go" if OS.mac?
brew "tailscale" if OS.mac?
brew "git-credential-manager" if OS.mac?

cask "orbstack" if OS.mac?
